[GraphicalObject]
Name=iso
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgisopmp|dgChangeDiagHelpIndex INSTPANEL| "
Rc-DLL=hpleo008.dll

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=identify  ,  PUSHBUTTON ,hpgbut02.dll
3=logbook   ,  IMAGESET   ,hpgbut02.dll
4=temp      ,  IMAGESET   ,hpgbut02.dll
5=method    ,  IMAGESET   ,hpgbut02.dll
6=inletValve,  IMAGESET   ,hpgbut02.dll
7=PumpHead  ,  IMAGESET   ,hpgbut02.dll
8=damper    ,  IMAGESET   ,hpgbut02.dll
9=outvalve  ,  IMAGESET   ,hpgbut02.dll
10=mcgv      ,  IMAGESET   ,hpgbut02.dll
11=turnonoff,  PUSHBUTTON ,hpgbut02.dll

[ColorAlias]
1=blue       |  0,  0, 255


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel iso
Help=機器パネルのトップレベルへの切替


[PUSHBUTTON identify]
x=445
y=182
width=58
height=25
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=Identify|Identify|Identify
Command=dgIdentifyModule "lpmp"
Help=アイソクラティック ポンプ


[IMAGESET logbook]
x=455
y=14
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "ISOlogbook"|アイソクラティック ポンプ ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "ISOlogbook"|アイソクラティック ポンプ ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=114
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "ISOtemp"|アイソクラティック ポンプ温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "ISOtemp"|アイソクラティック ポンプ温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=64
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "ISOmethod"|アイソクラティック ポンプ メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "ISOmethod"|アイソクラティック ポンプ メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET inletValve]
x=80
y=60
width=32
height=47
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0=   BMP.dginlet1|BMP.dginlet1|BMP.dginlet1|@view.floatingmenu "DiagGuiReg[4]", "ISOinletValve"|アクティブ インレット バルブ
set1=   BMP.dginlet2|BMP.dginlet2|BMP.dginlet2|@view.floatingmenu "DiagGuiReg[4]", "ISOinletValve"|アクティブ インレット バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET PumpHead]
x=131
y=64
width=137
height=149
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgppump1|BMP.dgppump1|BMP.dgppump1|@view.floatingmenu "DiagGuiReg[4]", "ISOPumpHead"|ポンプ ヘッド アセンブリ
set1=   BMP.dgppump2|BMP.dgppump2|BMP.dgppump2|@view.floatingmenu "DiagGuiReg[4]", "ISOPumpHead"|ポンプ ヘッド アセンブリ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET damper]
x=155
y=4
width=66
height=43
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgdampr1|BMP.dgdampr1|BMP.dgdampr1|@view.floatingmenu "DiagGuiReg[4]", "ISOdamper"|高圧ダンパ
set1=   BMP.dgdampr2|BMP.dgdampr2|BMP.dgdampr2|@view.floatingmenu "DiagGuiReg[4]", "ISOdamper"|高圧ダンパ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET outvalve]
x=120
y=23
width=23
height=35
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgoutva1|BMP.dgoutva1|BMP.dgoutva1|@view.floatingmenu "DiagGuiReg[4]", "ISOoutvalve"|アウトレット ボール バルブ
set1=   BMP.dgoutva2|BMP.dgoutva2|BMP.dgoutva2|@view.floatingmenu "DiagGuiReg[4]", "ISOoutvalve"|アウトレット ボール バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET mcgv]
x=3
y=120
width=105
height=96
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgomcgv1|BMP.dgomcgv1|BMP.dgomcgv1|@view.floatingmenu "DiagGuiReg[4]", "ISOMCGV"|オプショナル マルチ-チャンネル グラジエント バルブ
set1=   BMP.dgomcgv2|BMP.dgomcgv2|BMP.dgomcgv2|@view.floatingmenu "DiagGuiReg[4]", "ISOMCGV"|オプショナル マルチ-チャンネル グラジエント バルブ
set2=   BMP.dgnomcgv|BMP.dgnomcgv|BMP.dgnomcgv||
Help=""

[PUSHBUTTON turnonoff]
x=425
y=10
width=15
height=15
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= RBMP.power|RBMP.power|RBMP.power_gray
Command=dgPumpTurnOnOrOff
Help=クリックでポンプ オンまたはオフ。
